
//*************************************************************************************************
//
// Набор поддерживаемых функций и доступных регистров
// 
//*************************************************************************************************

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>

#include "modbus_def.h"
#include "modbus_reg.h"

//*************************************************************************************************
// Перечень доступных функций контроллера
//*************************************************************************************************
const uint8_t func_access[] = { 
    FUNC_RD_HOLD_REG,       //0x03 (16-битная адресация) чтение из нескольких 
                            //регистров хранения (Read Holding Registers)
    FUNC_WR_SING_REG,       //0x06 (16-битная адресация) запись в один регистр 
                            //хранения (Preset Single Register)
    FUNC_WR_MULT_REG,       //0x10 (16-битная адресация) запись значений в несколько 
                            //регистров хранения (Preset Multiple Registers)
    FUNC_END
 };

//*************************************************************************************************
// Перечень доступных регистров для чтения (номер регистра - кол-во регистров чтения)
//*************************************************************************************************
const RegsRead regs_read[] = {
    //номер регистра        кол-во регистров чтения
    //------------------------------------------------------------
    { MBUS_REG_CTRL,        { 1, 3, 4, 6, 7, 9, 11, 12 } },
    { MBUS_REG_WTR_COLD,    { 2, 3, 5, 6, 8, 10, 11, }   },
    { MBUS_REG_COLD_PRESR,  { 1, 3, 4, 6, 8, 9, }        },
    { MBUS_REG_WTR_HOT,     { 2, 3, 5, 7, }              },
    { MBUS_REG_HOT_PRESR,   { 1, 3, 5, }                 },
    { MBUS_REG_WTR_FILTER,  { 2, 4, 5, }                 },
    { MBUS_REG_DAYMON,      { 2, 3, }                    },
    { MBUS_REG_HOURMIN,     { 1, }                       },
    { REG_END }
 };

//*************************************************************************************************
// Перечень регистров доступных для записи (номер регистра - кол-во регистров для записи)
//*************************************************************************************************
const RegsRead regs_write[] = {
    //номер регистра        кол-во регистров чтения
    //------------------------------------------------------------
    { MBUS_REG_CTRL,        { 1, }      },
    { MBUS_REG_DAYMON,      { 1, 3, }   },
    //{ MBUS_REG_YEAR,        { 1, }      },
    //{ MBUS_REG_HOURMIN,     { 1, }      },
    { REG_END }
 };

//*************************************************************************************************
// Диапазоны значений (мин - макc) для проверки перед записью в регистр
//*************************************************************************************************
const ValueValid val_valid[] = {
    //регистр               мин. знач.          макс. знач.
    //------------------------------------------------------------
    { MBUS_REG_CTRL,        0,                  MBUS_CMD_MASK },    //см. MBUS_CMD_*
    { MBUS_REG_DAYMON,      ( 1 << 8 ) | 1,     ( 12 << 8 ) | 31 }, //месяц/день
    { MBUS_REG_YEAR,        2020,               2999 },             //год
    { MBUS_REG_HOURMIN,     ( 0 << 8 ) | 0,     ( 23 << 8 ) | 59 }, //часы/минуты
    { REG_END }
 };

