
//*************************************************************************************************
//
// Набор функционала для получения даты и номера версии
// 
//*************************************************************************************************

#include <stdio.h>
#include <ctype.h>

#include "version.h"
#include "verdata.h"

//*************************************************************************************************
// Локальные константы
//*************************************************************************************************
#define FW_VERSION              ( ( FW_VERSION_MAJOR << 24 ) | ( FW_VERSION_MINOR << 16 ) | \
                                  ( FW_VERSION_BUILD << 8 ) | ( FW_VERSION_RC ) )

#define FW_DATE                 ( ( FW_DATE_DAY << 24 ) | ( FW_DATE_MONTH << 16 ) | FW_DATE_YEAR )

#define FW_TIME                 ( ( FW_TIME_HOUR << 16 ) | ( FW_TIME_MINUTES << 8 ) | FW_TIME_SECONDS )

//*************************************************************************************************
// Локальные переменные
//*************************************************************************************************
static char val_ver[32], val_date[14], val_time[12];

//*************************************************************************************************
// Расшифровка версии в текстовый буфер
//-------------------------------------------------------------------------------------------------
// uint32_t version - значение версии в формате: [31:24] main/major version
//                                               [23:16] sub1/minor version
//                                               [15:8]  sub2/build version
//                                               [7:0]   release candidate/type build
// char *str        - указатель на строку для размещения результата
// return           - указатель на строку с расшифровкой в формате main.sub1.sub2.rc
//*************************************************************************************************
char *FWVersion( uint32_t version ) {

    uint32_t main, sub1, sub2, rc;
    
    main = version >> 24;
    sub1 = ( version & 0x00FF0000 ) >> 16;
    sub2 = ( version & 0x0000FF00 ) >> 8;
    rc = version & 0x000000FF;
    if ( toupper( rc ) == 'R' || toupper( rc ) == 'D' )
        sprintf( val_ver, "%u.%u.%u.%c", main, sub1, sub2, rc );
    else sprintf( val_ver, "%u.%u.%u.%u", main, sub1, sub2, rc );
    return val_ver; 
 }

//*************************************************************************************************
// Расшифровка даты версии в текстовый буфер
//-------------------------------------------------------------------------------------------------
// uint32_t fw_date - значение версии в формате: [31:24] day
//                                               [23:16] month
//                                               [15:0]  year
// char *str        - указатель на строку для размещения результата
// return           - указатель на строку с расшифровкой в формате DD.MM.YYYY
//*************************************************************************************************
char *FWDate( uint32_t fw_date ) {

    uint32_t day, month, year;
    
    day = fw_date >> 24;
    month = ( fw_date & 0x00FF0000 ) >> 16;
    year = fw_date & 0x0000FFFF;
    sprintf( val_date, "%02u.%02u.%04u", day, month, year );
    return val_date; 
 }

//*************************************************************************************************
// Расшифровка времени версии в текстовый буфер
//-------------------------------------------------------------------------------------------------
// uint32_t fw_time - значение версии в формате: [23:16] - hour
//                                               [15:8]  - minutes
//                                               [7:0]   - seconds
// char *str        - указатель на строку для размещения результата
// return           - указатель на строку с расшифровкой в формате HH:MM:SS
//*************************************************************************************************
char *FWTime( uint32_t fw_time ) {

    uint32_t hour, min, sec;
    
    hour = fw_time >> 16;
    min = ( fw_time & 0x0000FF00 ) >> 8;
    sec = fw_time & 0x000000FF;
    sprintf( val_time, "%02u:%02u:%02u", hour, min, sec );
    return val_time; 
 }

//*************************************************************************************************
// Функция возвращает номер версии прошивки
//-------------------------------------------------------------------------------------------------
// return: формат версии [31:24] - main/major version 
//                       [23:16] - sub1/minor version
//                       [15:8]  - sub2/build version
//                       [7:0]   - release candidate/type build
//*************************************************************************************************
uint32_t GetFwVersion( void ) {

    return FW_VERSION;
 }

//*************************************************************************************************
// Функция возвращает дату версии прошивки
//-------------------------------------------------------------------------------------------------
// return: формат даты [31:24] - day 
//                     [23:16] - month
//                     [15:0]  - year
//*************************************************************************************************
uint32_t GetFwDate( void ) {

    return FW_DATE;
 }

//*************************************************************************************************
// Функция возвращает дату версии прошивки
//-------------------------------------------------------------------------------------------------
// return: формат даты [23:16] - hour
//                     [15:8]  - minutes
//                     [7:0]   - seconds
//*************************************************************************************************
uint32_t GetFwTime( void ) {

    return FW_TIME;
 }
